In [3]:
def celtofer(c):
    f = (c * 9/5) + 32
    print(f)

In [4]:
celtofer(10)

50.0

In [5]:
class CeltoFer:
    def __init__(self,c):
        self.c = c 
        
    def celtofer(self):
        f = (self.c * 9/5) + 32
        print(f)

In [11]:
c2

In [9]:
c1 = CeltoFer(10)
c1.celtofer()

50.0

In [7]:
c2 = CeltoFer(20)
c2.celtofer()

68.0

In [27]:
class Employee:
    company_name = 'Deloitte'
    def __init__(self,eno,efname,elname,esalary,eloc):
        self.eno = eno
        self.efname = efname
        self.elname = elname
        self.esalary = esalary
        self.eloc = eloc
        
    def display(self):
        print('The employee id is: ', self.eno)
        print('The employee name is: ', self.efname + ' ' + self.elname)
        print('The employee salary is: ', self.esalary)
        print('The employee location is: ', self.eloc)
        print('Your company name is: ', Employee.company_name)
        
    def tax_calc(self):
        if self.esalary<2500:
            print('The tax you have to pay is: ', self.esalary*0.0)
        elif self.esalary>=2500 and self.esalary<=5000:
            print('The tax you have to pay is: ', self.esalary*0.05)
        elif self.esalary>5000 and self.esalary<=10000:
            print('The tax you have to pay is: ', self.esalary*0.10)
        else:
            print('The tax you have to pay is: ', self.esalary*0.20)
        
    def bonus_calc(self):
        if self.eloc=='Delhi':
            print('You have total bonus as : ', self.esalary*0)
        elif self.eloc=='Ballarpur':
            print('You have total bonus as : ', self.esalary*0.10)
        else:
            print('You have total bonus as : ', self.esalary*0.20)

In [28]:
emp1 = Employee(1,'A','R',1000,'Bal')
emp1.display()
emp1.tax_calc()
emp1.bonus_calc()

The employee id is:  1
The employee name is:  A R
The employee salary is:  1000
The employee location is:  Bal
Your company name is:  Deloitte
The tax you have to pay is:  0.0
You have total bonus as :  200.0

In [21]:
list1 = [1,2,3,4]
print(type(list1))

<class 'list'>

In [42]:
import sys
class Customer:
    bankname = 'BIT Bank'
    def __init__(self, name, balance=0.0):
        self.name = name
        self.balance = balance
        
    def deposit(self,amount):
        self.balance = amount+self.balance
        print('The total balance is: ', self.balance)
        
    def withdraw(self,amount):
        if amount>self.balance:
            print('Insufficient balance, be practical')
            sys.exit()
        self.balance = self.balance-amount
        print('The total balance is: ', self.balance)
        
print('Welcome to: ', Customer.bankname)
c1 = Customer('Abhay')
while True:
    print('d-Deposit \nw-Withdraw \ne-Exit')
    option = input('Let us know what you want to do: ').lower()
    if option=='d':
        amount = float(input('Enter the amount you want to deposit: '))
        c1.deposit(amount)
    elif option=='w':
        amount = float(input('Enter the amount you want to withdraw: '))
        c1.withdraw(amount)
    elif option=='e':
        print('Thank you for banking with us')
        sys.exit()
    else:
        print('Invalid option selected, please choose the correct option')

Welcome to:  BIT Bank
d-Deposit
w-Withdraw
e-Exit
Let us know what you want to do: d
Enter the amount you want to deposit: 50000
The total balance is:  50000.0
d-Deposit
w-Withdraw
e-Exit
Let us know what you want to do: 2500
Invalid option selected, please choose the correct option
d-Deposit
w-Withdraw
e-Exit
Let us know what you want to do: w
Enter the amount you want to withdraw: 2500
The total balance is:  47500.0
d-Deposit
w-Withdraw
e-Exit
Let us know what you want to do: d
Enter the amount you want to deposit: 25000
The total balance is:  72500.0
d-Deposit
w-Withdraw
e-Exit
Let us know what you want to do: w
Enter the amount you want to withdraw: 100000000
Insufficient balance, be practical

SystemExit:

In [43]:
#Pandas

In [44]:
import pandas as pd

In [45]:
pd.__version__

'1.4.4'

In [46]:
stu_details = {'sid':[1,2,3,4,5],'sname':['A','B','C','D','E'],'sregion':['S','N','E','W','E']}

In [49]:
df1 = pd.DataFrame(stu_details)

In [58]:
stu_marks = {'s_id':[1,2,3,4,6],'ssub':['Py','R','Jav','Py','Py'], 'smarks':[10,9,8,9,10]}

In [59]:
df2 =pd.DataFrame(stu_marks)

In [60]:
df1

   sid sname sregion
0    1     A       S
1    2     B       N
2    3     C       E
3    4     D       W
4    5     E       E

In [61]:
df2

   s_id ssub  smarks
0     1   Py      10
1     2    R       9
2     3  Jav       8
3     4   Py       9
4     6   Py      10

In [63]:
pd.merge(df1,df2,left_on=['sid','sname'],right_on=['s_id','sname'])

   sid sname sregion  s_id ssub  smarks
0    1     A       S     1   Py      10
1    2     B       N     2    R       9
2    3     C       E     3  Jav       8
3    4     D       W     4   Py       9

In [66]:
pd.merge(pd.merge(df1,df2,left_on='sid',right_on='s_id',how='outer'),df3)

   sid sname sregion  s_id ssub  smarks
0  1.0     A       S   1.0   Py    10.0
1  2.0     B       N   2.0    R     9.0
2  3.0     C       E   3.0  Jav     8.0
3  4.0     D       W   4.0   Py     9.0
4  5.0     E       E   NaN  NaN     NaN
5  NaN   NaN     NaN   6.0   Py    10.0

In [72]:
stu_details_ind = {'sid':[1,2,3,4,5],'sname':['A','B','C','D','E'],'sregion':['S_IN','N_IN','E_IN','W_IN','E_IN']}

In [68]:
stu_details_ind

{'sid': [1, 2, 3, 4, 5],
 'sname': ['A', 'B', 'C', 'D', 'E'],
 'sregion': ['S_IN', 'N_IN', 'E_IN', 'W_IN', 'E_IN']}

In [71]:
stu_details_us = {'sid':[6,7,8,9,5],'sname':['P','Z','Y','X','E'],'sregion':['S_US','N_US','E_US','W_US','E_IN']}

In [73]:
stu_details_ind

{'sid': [1, 2, 3, 4, 5],
 'sname': ['A', 'B', 'C', 'D', 'E'],
 'sregion': ['S_IN', 'N_IN', 'E_IN', 'W_IN', 'E_IN']}

In [74]:
stu_details_us

{'sid': [6, 7, 8, 9, 5],
 'sname': ['P', 'Z', 'Y', 'X', 'E'],
 'sregion': ['S_US', 'N_US', 'E_US', 'W_US', 'E_IN']}

In [75]:
df_in = pd.DataFrame(stu_details_ind)

In [76]:
df_us = pd.DataFrame(stu_details_us)

In [77]:
df_in

   sid sname sregion
0    1     A    S_IN
1    2     B    N_IN
2    3     C    E_IN
3    4     D    W_IN
4    5     E    E_IN

In [78]:
df_us

   sid sname sregion
0    6     P    S_US
1    7     Z    N_US
2    8     Y    E_US
3    9     X    W_US
4    5     E    E_IN

In [82]:
output = pd.concat([df_in,df_us]).reset_index().drop('index',axis=1).drop_duplicates()

In [83]:
output

   sid sname sregion
0    1     A    S_IN
1    2     B    N_IN
2    3     C    E_IN
3    4     D    W_IN
4    5     E    E_IN
5    6     P    S_US
6    7     Z    N_US
7    8     Y    E_US
8    9     X    W_US

In [86]:
pd.concat([df_in,df_us],axis=0)

   sid sname sregion
0    1     A    S_IN
1    2     B    N_IN
2    3     C    E_IN
3    4     D    W_IN
4    5     E    E_IN
0    6     P    S_US
1    7     Z    N_US
2    8     Y    E_US
3    9     X    W_US
4    5     E    E_IN